{
  "title": {
    "textContent": "Город Неонсити — мегаполис в центре пустыни, окутанный густыми облаками дыма и неоновым сиянием рекламных вывесок. Власть в городе контролируется корпорацией \"КиберДайнамикс\", которая поддерживает стабильность, но в то же время властвует над жителями, ограничивая их свободу и права.",
    "maleCharName": "Айзек, Солдат.",
    "maleCharBio": "Солдат корпоративной армии \"КиберДайнамикс\", с мощнейшими киберимплантами. Также был модифицирован экспериментальным чипом, который не позволяет ослушаться приказов корпорации. Ему было поручено выследить и уничтожить Миру.",
    "femaleCharName": "Мира, Нетраннер.",
    "femaleCharBio": "Является хакером с выдающимися навыками взлома. Она способна проникнуть в самые защищенные системы \"КиберДайнамикс\" и украсть ценные данные. Её цель — разоблачить корпорацию и вернуть свободу жителям Неонсити.",
    "type": "TITLE",
    "actions": []
  },

  "events": {
    "begin": {
      "textContent": "Мира внезапно проснулась в своих апартаментах от чувства непривычной тревоги. Оглянувшись вокруг, она не заметила ничего необычного.",
      "type": "NORMAL",
      "actions": [
        {
          "textContent": "Попытаться снова уснуть",
          "nextEvent": "ap_sleep"
        },
        {
          "textContent": "Обойти апартаменты и убедится что всё в порядке",
          "nextEvent": "ap_walk"
        },
        {
          "textContent": "Взять пистолет и спрятаться",
          "nextEvent": "ap_hide"
        }
      ]
    },
    "ap_hide": {
      "textContent": "Почуяв неладное, Мира хватает пистолет со столика и медленно пятится назад, к ближайшему укрытию. Рядом находится окно, а также в стене спрятан небольшой оружейный арсенал. Она долго выжидает, и в момент когда она уже была готова ослабить бдительность, в комнату со звоном залетает металлический предмет. Секунда, и всю комнату охватывает облако густого дыма.",
      "type": "NORMAL",
      "actions": [
        {
          "textContent": "Выбраться через окно",
          "nextEvent": "ap_win"
        },
        {
          "textContent": "Открыть оружейный арсенал",
          "nextEvent": "ap_ars"
        },
        {
          "textContent": "Открыть огонь из пистолета в область откуда прилетела граната",
          "nextEvent": "ap_fire"
        }
      ]
    },
    "ap_fire": {
      "textContent": "В коридоре, сквозь клубы дыма, еле показался огромный мужской силуэт. Мира незамедлительно открыла огонь из пистолета. Несколько попаданий по противнику высекли искры, а тот даже не двинулся с места. -Чёртов киборг! -выругалась Мира.",
      "type": "NORMAL",
      "actions": [
        {
          "textContent": "Выбраться через окно",
          "nextEvent": "ap_win"
        },
        {
          "textContent": "Открыть оружейный арсенал",
          "nextEvent": "ap_ars2"
        }
      ]
    },
    "ap_ars": {
      "textContent": "Мира молниеносно подлетает к сканирующей панели на стене и прикладывает руку. После небольшой задержки открывается маленький оружейный арсенал.",
      "type": "NORMAL",
      "actions": [
        {
          "textContent": "Штурмовая винтовка",
          "nextEvent": "ap_w1"
        },
        {
          "textContent": "Электромагнитная граната",
          "nextEvent": "ap_w2"
        },
        {
          "textContent": "Дробовик",
          "nextEvent": "ap_w3"
        }
      ]
    },
    "ap_win": {
      "textContent": "<Эта сцена является заглушкой> Мира прыгает в окно и ей удается сбежать.",
      "type": "WIN",
      "actions": []
    },
    "ap_w1": {
      "textContent": "<Эта сцена является заглушкой> Выбранное оружие неэффективно!",
      "type": "LOSE",
      "actions": []
    },
    "ap_w2": {
      "textContent": "<Эта сцена является заглушкой> Хороший выбор! это то, что легко остановит киборга с кучей имплантов!",
      "type": "WIN",
      "actions": []
    },
    "ap_w3": {
      "textContent": "<Эта сцена является заглушкой> Выбранное оружие неэффективно!",
      "type": "LOSE",
      "actions": []
    },
    "ap_sleep": {
      "textContent": "Мире снова удалось задремать. Но следующее что она увидела, когда вновь открыла глаза - это огромный мужской силуэт, стоявший возле кровати. Она дернулась к прикроватному столику, чтобы схватить пистолет, но было уже слишком поздно. Массивное лезвие, появившееся из ладони незнакомца, вонзилось ей прямо в горло. Не способная закричать, она медленно теряла остатки сознания.",
      "type": "LOSE",
      "actions": []
    },
    "ap_walk": {
      "textContent": "Мира решает осмотреться. Она не спеша встает с кровати и потягиваясь направляется на кухню, чтобы заварить кофе. Сделав несколько шагов по плохо освещенному коридору она вдруг ощущает холод во всем теле ниже головы. Будто парализованная она как-то неестественно падает на пол, а следом грохнулось еще что-то. Последних секунд угасающего сознания хватило, чтобы понять что в другом конце коридора лежало ее обезглавленное тело.",
      "type": "LOSE",
      "actions": []
    },
    "ap_ars2": {
      "textContent": "Мира молниеносно подлетает к сканирующей панели на стене и прикладывает руку. В этот же момент, она начинает слышать звуки быстро приближающихся шагов переходящих в бег. Когда оружейный арсенал открывается, становится уже слишком поздно. Груда мышц и металла на полном ходу врезается в нее и отбрасывает в стену, в другой конец комнаты. Удар оказывается настолько сильным, что Мира не в состоянии больше двигаться. Убийца медленно подошел к обмякшему телу и завершил дело прямым ударом ноги в висок.",
      "type": "LOSE",
      "actions": []
    }
  }
}